//-------------------------------------------------------------------------*
// 文件名: wdog.c                                                          *
// 说  明: 看门狗驱动程序文件                                              *
//-------------------------------------------------------------------------*

#include "wdog.h"	//包含wdog.h头文件
       
//-------------------------------------------------------------------------*
//函数名: wdog_disable                                                     *
//功  能: 关闭看门狗模块                                                   * 
//参  数: 无			  					   *	
//返  回: 无                                                               *
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void wdog_disable(void)
{
    //给看门狗模块解锁，以便写寄存器
    wdog_unlock();
    //关闭看门狗
    WDOG_STCTRLH &= ~WDOG_STCTRLH_WDOGEN_MASK;
}

//-------------------------------------------------------------------------*
//函数名: wdog_unlock                                                      *
//功  能: 看门狗解锁                                                       * 
//参  数: 无							           *	
//返  回: 无                                                               *
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void wdog_unlock(void)
{
    /* 注意: 不要单步调试此程序!!! ，否则会引起CPU复位*/
    //关总中断
    DisableInterrupts;		
    //写解锁寄存器
    WDOG_UNLOCK = 0xC520;	
    //完成解锁
    WDOG_UNLOCK = 0xD928;	
    //开总中断
    EnableInterrupts;		
}
