//-------------------------------------------------------------------------*
// 文件名:sysinit.h                                                        *
// 说  明: 系统配置头文件                                                  *
//-------------------------------------------------------------------------*

#ifndef _SYSINIT_H_
#define _SYSINIT_H_
    //1 头文件
    #include "common.h"

    //2 宏定义
    #define K60_CLK             1
    #define REF_CLK             XTAL8 
    #define CORE_CLK_MHZ        PLL96   

    enum clk_option
    {
      PLL50,
      PLL100,
      PLL96,
      PLL48
    };
    
    enum crystal_val
    {
      XTAL2,
      XTAL4,
      XTAL6,
      XTAL8,
      XTAL10,
      XTAL12,
      XTAL14,
      XTAL16,
      XTAL18,
      XTAL20,
      XTAL22,
      XTAL24,
      XTAL26,
      XTAL28,
      XTAL30,
      XTAL32
    };
    
    //3 函数声明
    //-------------------------------------------------------------------------*
    //函数名: sysinit                                                          *
    //功  能: 系统设置                                                         * 
    //参  数: 无				 			       *	
    //返  回: 无                                                               *
    //说  明: 无                                                               *
    //-------------------------------------------------------------------------*
    void sysinit (void);
    
    //-------------------------------------------------------------------------*
    //函数名: trace_clk_init                                                   *
    //功  能: 跟踪时钟初始化                                                   * 
    //参  数: 无		 					       *	
    //返  回: 无                                                               *
    //说  明: 用于调试                                                         *
    //-------------------------------------------------------------------------*
    void trace_clk_init(void);
    
    //-------------------------------------------------------------------------*
    //函数名: fb_clk_init                                                      *
    //功  能: FlexBus时钟初始化                                                * 
    //参  数: 无							       *	
    //返  回: 无                                                               *
    //说  明:                                                                  *
    //-------------------------------------------------------------------------*
    void fb_clk_init(void);
    
    //-------------------------------------------------------------------------*
    //函数名: pll_init                                                         *
    //功  能: pll初始化                                                        * 
    //参  数: 无							       *	
    //返  回: 无                                                               *
    //说  明:                                                                  *
    //-------------------------------------------------------------------------*
    unsigned char pll_init(unsigned char, unsigned char);
    
    //-------------------------------------------------------------------------*
    //函数名: set_sys_dividers                                                 *
    //功  能: 设置系系统分频器                                                 * 
    //参  数: 无							       *	
    //返  回: 无                                                               *
    //说  明: 此函数必须放在RAM里执行，否则会产生错误e2448。当FLASH时钟分频改变* 
    //	      时，必须禁止FLASH的欲取功能。在时钟分频改变之后，必须延时一小段时*
    //	      间才可以从新使能欲取功能。                                       *
    //-------------------------------------------------------------------------*
    __ramfunc void set_sys_dividers(uint32 outdiv1, uint32 outdiv2, uint32 outdiv3, uint32 outdiv4);
	
#endif	



